{
 "line": [
   "The Dashboard Camera",
   "Char5 was driving char1 and char3 home from the event1.",
   "char5 was beaming as he5 spoke of his5 new dash cam in his5 car.",
   "char1 asked, 'char5, can we borrow your dash cam tomorrow?'",
   "Char5 hesitated, but soon agreed.",
   "Once home, char1 phoned Mrs Formosa.",
   "'Hello Mrs. Formosa, can we take your paddle boat out tomorrow onto your pond?'",
   "'Of course', she responded.",
   "Char1 phoned char2 and invited char2 to join them for a scientific adventure tomorrow.",
   "Char1 could hardly sleep with anticipation of his1 idea for the dash cam.",
   "Char2 and char3 arrived the next morning for char4's famous egg and bagel breakfast.",
   "After breakfast, the three of them talked and collected items needed for the adventure.",
   "They excitedly made the 20 minute walk down to Formosa's Pond.",
   "Once they arrived at the pond, char2 said, 'Oh, this will be fun'.",
   "Char2 was the more scientific of the three.",
   "Char2 said, 'I bet no one has ever done this type of thing in Formosa's Pond'.",
   "char3 said, 'Yes, char1, it is a brilliant idea'.",
   "Char2 and Char3 began removing the leaves from the four-man paddle boat.",
   "Char1 pulled out the dash cam, powered it on, and placed it into a zip lock plastic bag.",
   "Then he pulled out a small two inch flashlight, powered it on, and added it to bag",
   "All three jumped into the boat and paddled out to the middle of the pond.",
   "The sun was bright and sunbeams radiated down into the water.",
   "Char1 tied a string to the zip lock bag.",
   "He1 double checked to ensure the bag was sealed.",
   "Char3 made sure the string was tied to the boat, simply to make sure they did not lose the dash cam and flashlight.",
   "Char1 slowly placed the bag into the water.",
   "'Darn, the bag has too much air, and it floats.'",
   "Char2 pulled out a second zip lock bag and added several rocks he2 had collected from the bank of the pond.",
   "'We will tie this bag of rocks ten inches below the other bag to pull the dash cam down.'",
   "They put holes in the bag of rocks to allow the air to escape.",
   "Char2 pulled a bagel from his2 pocket, tore it into pieces, and added it to the bag of rocks.",
   "'Chum?', asked char1.",
   "'Yes'",
   "Char3 asked, 'What is Chum?'",
   "Char1 responded, 'Fish food. It will attract the fish.'",
   "char3 said, 'You are brilliant as usual, char2.'",
   "Shortly, they were lowering the bag of rocks into the water, followed by the bag with the camera.",
   "char3 said, 'It is working brilliantly.'",
   "The bag of rocks successfully submerged the camera bag.",
   "They could see the beam of the flashlight slowly fade as it descended deeper and deeper.",
   "Char2 said, 'When the bag of rocks hits the bottom, the camera will be ten inches above the bottom.'",
   "They slowly fed more string.",
   "The light finally submerged out of sight.",
   "As they fed more and more string, they wondered aloud, 'Geez, how deep is this pond?'",
   "It kept going deeper and deeper.",
   "When the string finally became limp, they knew they had reached the bottom.",
   "Char3 asked, 'Now what?'",
   "Char1 and Char2 did not say a word.",
   "Char1 put his1 index finger vertically to his1 lips.",
   "char2 put his2 arms out horizontally as he2 opened his hands with palms down.",
   "All three stayed quiet and calm.",
   "They waited.",
   "And waited.",
   "The string suddenly started moving a bit.",
   "Char3 wanted to pull on the string.",
   "But the others stopped him3.",
   "They waited.",
   "And waited.",
   "After 38 minutes, char1 said, 'Let's pull it up.'",
   "'Why now?', said char3.",
   "Char1 said, '38 is my lucky number'.",
   "All three agreed.",
   "They retrieved the camera, but the flashlight was missing.",
   "They paddled to shore, and put the boat back in its place.",
   "They ran the entire way back to char1's house.",
   "They downloaded the video to char5's computer.",
   "They laughed as they could see themselves in the video.",
   "As the video began to submerge into the water, char3 again said, 'This is brilliant.'",
   "Char2 whispered, 'I measured the string. The camera was 72 feet deep.'",
   "'Good thing we added the flashlight'",
   "As they watched the video, they waited.",
   "And waited.",
   "Nothing.",
   "The video was amazingly crisp and vivid.",
   "They could clearly see the bottom of the pond.",
   "char2 whispered, 'I am guessing we can see about five feet'.",
   "Char1 whispered, 'Why are we whispering?'",
   "All three laughed. It just seemed normal to whisper while watching the video.",
   "It was spooky, yet exciting.",
   "The camera was not shifting. It was not moving one bit.",
   "'But what about the string moving?', asked char3, 'What was that?'",
   "Char1 looked at the timer on his1 phone, 'Not yet', said char1.",
   "'We are only four minutes into the video.'",
   "Finally a minnow appeared.",
   "Then more minnows.",
   "They were tiny.",
   "They moved dartedly.",
   "More minnows appeared.",
   "There were probably two dozen of them, and they were nipping at the drifting bagel chum.",
   "char5 came in to watch over their shoulders.",
   "The camera angle began to shift a bit as the minnows swam past.",
   "As the camera shifted, they could sometimes see the bag of rocks and chum on the bottom.",
   "Several minnows actually swam thru the holes in the bottom bag to get more chum.",
   "For the minnows, it was all about the chum.",
   "For char1, char2, and char3, it was all about the minnows.",
   "For char5, it was all about the camera and the clarity of the video.",
   "For petname1, char1's pet1, it was all about the remainder of the bagel that char2 had tossed into the trash.",
   "Suddenly, bam.",
   "The camera angle jerked.",
   "The water quickly clouded and became murky.",
   "The light from the flashlight disappeared",
   "Then, nothing.",
   "The video remained dark.",
   "No minnows.",
   "Nothing.",
   "They could barely see in the darkness that the water remained muddy as the 38th minute of the video clicked by.",
   "Char5 speculated a catfish likely came along and spoiled the party for the minnows.",
   "Then, out of nowhere, a huge, glowing eye appeared on the video.",
   "The eye took up the entire screen.",
   "Then they saw a webbed foot flashed by.",
   "'Weird, very weird.'",
   "They watched the end of the video several times.",
   "'It looks like a huge frog', said char2",
   "'But frog's eyes do not glow like that.'",
   "char5 agreed",
   "Later that evening they phoned Mrs. Formosa.",
   "char1 said, 'Thank you for letting us take your paddle boat onto the pond today'.",
   "Mrs. Formosa responded, 'You are very welcome, my dear. However, the sheriff is here now. Everything is ok, but I have to go. Bye.'",
   "The next day, there was a knock at char1's door.",
   "char4 answered the door",
   "It was the sheriff.",
   "The sheriff said, 'We have a strange glowing frog that we captured last night down at the Formosa Pond. We've phoned the state biologists to come look'",
   "char1 ran to the door and explained their story.",
   "Later that evening, char1, char2, and char3 were on the national news.",
   "David Muir asked char3 for a comment. char3 smiled and said, 'It was brilliant. Simply brilliant.'",
   " ",
   "The End",
   "Written by, Kibity"
   ]
}
