{
 "line": [
   "Every summer when school lets out for summer vacation, char1 and family would set out for the long drive from city1 to Illinois for a week of vacation at Grandma and Grandpa's house.",
   "Although it was a long drive, it was always fun to go visit.  char1 always looked forward to it.",
   "On Saturday morning bright and early, char1 and char2 climbed out of bed when char4 called to wake them up.",
   "char1 and char2 got dressed, ate breakfast, and helped to finish packing the car for the long trip.",
   "When char4 and Char5 decided they had everything packed and they had checked all the things to do from the To Do List, everyone climbed into the car including the pet1, PetName1.",
   "Char5 said, 'Here we go', and away they went.",
   "It wasn't until they were about 20 minutes into the trip that char1 discovered she1 had left her1 favorite doll, Sweetie Pie, at home.",
   "char1 immediately started crying her1 eyes out.",
   "Char4 asked 'What's wrong char1?'.",
   "char1 cried out, 'I left Sweetie Pie at home'.",
   "Char4 looked at Char5 when Char5 said, 'No, we're not turning around'.",
   "char1 cried even harder.",
   "Char1 cried for 10 more minutes.",
   "Then Char5 finally decided to turn around so char1 could get Sweetie Pie.",
   "After about an hour, they had gone back home, char1 had gotten Sweetie Pie, and now they were back on the road again.",
   "Char5 said, 'If anyone forgot anything else, there will be no more turning around.",
   "char1 was1 happy now because she1 had her1 beloved Sweetie Pie.",
   "As they proceeded down the road, char2 said, 'Let's play a game'.",
   "char2 said, 'Let's take turns calling out something, and the first person to see it and shout it out gets a point'.",
   "'The person who gets the most points is the winner.'",
   "char2 said, 'I'll go first so you'll see how to play'.",
   "char2 said, 'Ok, who will be the first to see a brown cow?'.",
   "Everyone started looking out the car windows to see who would be the first to see a brown cow.",
   "They saw a train passing by, a couple of horses, several dogs, flowers, trees, a brown car, a brown house.",
   "Finally, char4 called out and pointed, 'Out the window to the left is a brown cow!'.",
   "'Woo Hoo, char4 got the first point.'",
   "Then it was char4's turn and to name something to search for.",
   "Char4 said, 'Ok, who will be the first to see a pink house?'.",
   "Everyone started looking out the windows again.",
   "char1 saw a blue house.",
   "char2 saw a green house.",
   "char1 saw a yellow house.",
   "Suddenly char2 screamed out, 'I see one! I see a pink house', and pointed out the window to the right.",
   "Everyone laughed with surprise.",
   "Wouldn't you just know it, char2 had indeed seen a pink house.",
   "It was funny, because it wasn't a regular house, but instead it was a pink, play house.",
   "It was behind a great big white house, tucked in between some trees.",
   "char2 beamed with pride for winning a point.",
   "So far char4 had a point, and char2 had a point.",
   "char2 said, 'Who can find a yellow car?'.",
   "The game was on again.",
   "Everyone was searching out the car windows for a yellow car.",
   "Char5 was5 looking at the cars coming in the opposite direction toward them.",
   "char1 and char2 were looking at the cars they passed on either sides of the road.",
   "Char4 was4 looking everywhere.",
   "Suddenly a car came up from behind them and began to pass them.",
   "It was a yellow Volkswagen Beetle car.",
   "Everyone began shouting at the same time.",
   "Everyone at the same time saw the yellow Volkswagen Beetle car.",
   "Everyone got a point as they laughed.",
   "How about that!  Who would have ever guessed!",
   "char2 said, 'I'm hungry'.",
   "char1 said, 'I have to go to the bathroom'.",
   "Char5 said, 'Well, I guess it's a good time to stop.",
   "We are in the middle of a big town and have a lot of places to pick from'.",
   "Char5 found a place to get gas, and right beside the gas station was a McDonalds.",
   "While Char5 got the gas, char1, char2 and char4 all walked across the parking lot over to McDonalds.",
   "char1 and char2 both went to the bathroom, while char4 waited outside for them.",
   "Once finished and all hands were washed, char1 and char2 met char4 who was4 patiently waiting.",
   "They walked over and placed orders.",
   "Back in the car everyone, including Sweetie Pie, got situated.",
   "Char4 handed out hamburgers and French fries along with drinks.",
   "The car became quiet for a while as Char5 drove and everyone ate.",
   "Shortly thereafter, things got really quiet as char1, char2 and even char4 fell asleep.",
   "A couple of hours later everyone started waking up, and char2 said, 'I have to go to the bathroom again'.",
   "Char5 said, 'I was expecting that'.",
   "he5 pulled over a few miles later into a gas station.",
   "Char5 said, 'I will fill the car up with the gas'.",
   "Meanwhile, everyone hurried to the bathroom.",
   "Afterwards, they were once again on the road.",
   "char1 said, 'How much longer before we get there?'.",
   "Char5 said, 'We have about 4 more hours to go'.",
   "char1 and char2 frowned at the thought of riding 4 more hours.",
   "Char4 said, 'I have a surprise for you'.",
   "char1 and char2 smiled with excitement and asked for the surprise.",
   "Char4 handed char1 and char2 each a coloring book and a box of crayons.",
   "How exciting!  char1 and char2 loved to color.",
   "After a couple of hours, char1 and char2 fell asleep again.",
   "When char1 and char2 started to wake up, char2 said, 'Where are we?'.",
   "Char5 replied, 'We just turned onto the street where I grew up'.",
   "char1 looked at char2 with confusion.",
   "Suddenly, they both realized they were almost there!",
   "They were almost at Grandma and Grandpa's house.",
   "When they pulled up in the driveway, Grandma and Grandpa were both standing on the back porch steps waving hello.",
   "char1 and char2 unbuckled their seatbelts and jumped out of the car.",
   "They both ran over to Grandma and Grandpa and gave them both big hugs.",
   "They loved coming here to visit as there was so much to do and explore.",
   "They gathered their things from the car and ran into the house and unpacked.",
   "They all gathered in Grandma's kitchen.",
   "Grandma was the best cook. Fried chicken was waiting for them on the table.",
   "Gravy and biscuits, corn, peas and carrots, and for desert was a homemade chocolate cake.",
   "Everyone ate, talked, laughed and caught up on how much char1 and char2 had grown.",
   "After dinner char1 and char2 went out on the front porch to swing.",
   "They continued to swing until char4 interrupted. Char4 said, 'It is time to come in and take baths so we can go to bed.",
   "char1 and char2 each took their baths and readied themselves for bed.",
   "char1 would sleep with Grandma in her big feather bed, and char2 would sleep with Grandpa in his big bed.",
   "char1 and char2 giggled, because they knew Grandpa snored. It was always funny to hear him.",
   "The next morning char1 and char2 awoke to the smell of Grandma cooking breakfast.",
   "It seemed Grandma was always in the kitchen cooking and cleaning.",
   "As they got up, got dressed and went into the kitchen, they found scrambled eggs, bacon, grits, toast and homemade jelly on the table waiting for them.",
   "char1 and char2 dug in!",
   "After breakfast char1 and char2 went outside to explore and see what had changed since last year.",
   "They walked down the railroad tracks a short while.",
   "They walked thru a deserted lot beside Grandma and Grandpa's house.",
   "They found some old bottles.  They picked them up and rushed over to show them to Grandpa.",
   "Grandpa said, 'These bottles are a good find. These are old medicine bottles that were used back in the day'.",
   "Grandpa, char1, and char2 took the medicine bottles over to the outdoor water faucet and rinsed them off.",
   "There were 2 blue bottles, a clear bottle, and a brown one.  char1 and char2 were proud.",
   "Just then Grandma leaned out the back door and said, 'Lunch is ready'.",
   "char2 said, 'Oh boy. Let's eat!'.",
   "Everyone gathered at the kitchen table.",
   "There was country style steak with gravy, corn and butter beans, sliced tomatoes and biscuits.",
   "Grandma sure was a good cook.",
   "After lunch char1 and char2 both laid on the floor in the living room to watch TV.",
   "It only took 5 minutes for both char1 and char2 to fall fast asleep.",
   "After waking from the nap, char1 and char2 went out on the front porch to swing again.",
   "This was a family favorite to sit out on the porch swing, wave at the people who passed by, and talk about the way things use to be.",
   "char1 and char2 saw the kid from across the street playing alone in his3 yard.",
   "Char1 asked char4, 'Is it ok to go over and play with the kid across the street'.",
   "She4 said, 'That's fine, as long as you do not go anywhere else and you come home promptly when you were called for dinner'.",
   "Char1 said, 'We promise'.",
   "Char1 and Char2 ran across the street over to the kid.",
   "Char1 said, 'Hi. We just came to visit Grandma and Grandpa.",
   "My name is Char1, and this is Char2.",
   "What's your name?'",
   "The kid said, 'My name is Char3'.",
   "He3 asked, 'Would you like to see my tree house in the back yard?'.",
   "Char1 and Char2 said, 'Wow you have a tree house?  Yes let's see it.'.",
   "The three of them ran to the back yard. Thet climbed up the boards nailed to the tree trunk and up into the tree house.",
   "It was the neatest tree house Char1 and Char2 had ever imagined.",
   "It was big with a roof and windows.",
   "Char3 said, 'My father built it for me last summer'.",
   "The three sat in the tree house talking.",
   "They giggled about the games they liked to play, favorite movies and songs, and about their favorite pets and friends.",
   "It seemed like it had only been a few minutes, but it had actually been several hours when Char1 and Char2 heard char4 calling for them to come in for dinner.",
   "Char1 said, 'We'd better leave because if we don't char4 will not let us come back to visit you, char3'.",
   "The three climbed down from the tree house, and Char1 and Char2 ran back to Grandma and Grandpa's house.",
   "After washing their hands, they promptly sat down at the kitchen table.",
   "Grandma had cooked spaghetti with meatballs.",
   "This was Char1 and Char2's favorite of all.",
   "They both loved swirling the spaghetti noodles around with their fork and slurping the spaghetti noodles up.",
   "It was always fun to eat spaghetti.",
   "Grandma said, 'The best is yet to come'.",
   "She said, 'After dinner we are going to make homemade ice cream'.",
   "Char1 and Char2 had never made homemade ice cream before.",
   "Grandma said, 'It will be vanilla ice cream, and we have every type of topping to put on the ice cream'.",
   "Char2 said, 'I like sprinkles on my ice cream'.",
   "Char1 said, 'I like chocolate syrup'.",
   "As promised, they made homemade ice cream with an electric ice cream maker.",
   "When it stopped churning, Grandma exclaimed, 'It's ready'.",
   "They each scooped a bowl full of vanilla ice cream and added their favorite toppings.",
   "After filling up on ice cream, Char2 could barely keep his2 eyes open.",
   "Char4 said, 'It's bath time and then to bed'.",
   "Char1 and Char2 each took their baths and then hopped into bed for a good night's sleep.",
   "Char1 thought how much fun it was to come to Grandma and Grandpa's house.",
   "The week quickly flew by.",
   "Before anyone realized it the day had arrived to head home.",
   "After packing the car and saying their goodbyes to Grandma, Grandpa and Char3, they all climbed into the car.",
   "This time before Char5 started the car, Char5 turned around and asked, 'Char1 where is Sweetie Pie?'.",
   "Char1 smiled and said, 'Right here. I never took her out of the car'.",
   "Everyone laughed!",
   " ",
   "The End",
   "Written by, Cricket Allen"
   ]
}
