{
 "line": [
   "Home Under The Rainbow",
   "char1 was1 in a bad mood.",
   "The event1 was originally scheduled to be tonight, but it was postponed due to weather.",
   "char1 jumped into the car with char4.",
   "He1 might as well go to the grocery store with him4.",
   "Maybe he1 could convince char4 to buy some snack1.",
   "The clouds were dark and gray.",
   "The rain was puddling along the roadsides",
   "char1 imagined popping his1 foot into the puddle and splashing water onto his1 favorite friend char2.",
   "char1 loved being outside with char2, because char2 had a passion for the weather and other outdoor things.",
   "At the store everyone seemed to be in a bad mood.",
   "The weather was likely affecting everyone.",
   "Ugh. What a day.",
   "No event1. char4 wouldn't pick up snack1.",
   "And it continued to pour rain as they drove home.",
   "Ugh.",
   "As they drove past char2's house, char2 was2 looking out the front window of the house.",
   "'Yes', said char1, 'char2 is watching the weather as usual.'",
   "char4 nodded in agreement and said 'Would you like me to drop you off at char2's house?'",
   "'No', said char1. 'char2 will just want to talk about the weather and clouds and stuff'.",
   "'Just take me home'.",
   "Once home, char1 had nothing to do.",
   "Today is just horrible, he1 mumbled as he1 nodded off to sleep.",
   "A knock at the door awakened char1.",
   "It was char3, and he3 was3 walking over to char2's house as the rain was finally letting up.",
   "There was just a little sprinkle falling so char1 agreed to join him3.",
   "As char3 and char1 crested the hill to char2's street, the sun was finally breaking through the clouds.",
   "They saw char2 walking briskly toward them.",
   "'Look behind you' said char2.",
   "They turned to see an incredible rainbow.",
   "Char2 yelled: 'All seven colors are clearly visible'",
   "Then he2 began to sing",
   "'Red, orange, yellow.",
   "Green and blue.'",
   "Indigo,",
   "and you know,",
   "there's violet too.",
   "Come on, sing with me",
   "Red, orange, yellow.",
   "Green and blue.",
   "Indigo,",
   "and you know,",
   "there's violet too.'",
   "Char3 and char1 did not sing, but they were in awe of the most magnificent rainbow ever.",
   "The rainbow curved down to the left and disappeared behind a group of pine trees.",
   "They ran towards the pine trees.",
   "Once they arrived at the grove of pine trees, they could still see the rainbow in the distance through the canopy of the trees.",
   "It was a short distance thru the wooded area.",
   "The rain continued to slowly trickle.",
   "They exited the wooded area near a huge house.",
   "Char3 said, 'That's Doctor Fussell's place.'",
   "The left side of the rainbow fell behind Doctor Fussell's house.",
   "So they ran behind Doctor Fussell's house.",
   "They kept chasing the rainbow through several neighbors' yards.",
   "Before they realized it, they were on the old school grounds of Medlin Elementary.",
   "Medlin school had long closed and was run down.",
   "Char1 remembered the story char6 often told about Medlin Elementary.",
   "Long ago char6 would bring her6 old Australian Cattle dog, Skippy, to play on the old wooden merry-go-round.",
   "Char6 and Skippy would ride while her6 dad would spin the merry-go-round faster and faster.",
   "After spinning, they would step off and Skippy would walk sideways and in circles for about 20 seconds.",
   "Then Skippy would jump back on wanting another ride.",
   "It was obvious Char6 loved Skippy as much as char1 loved petname1.",
   "Char6's favorite colors are red and blue in remembrance of Skippy's red and blue collar.",
   "The rainbow was still shining brightly.",
   "They knew they had to go further and continue chasing the rainbow.",
   "The rainbow led them off the old school grounds into a field.",
   "At the far end of the field the rainbow seemed to end at an old oak tree.",
   "Char2 then explained 'Rainbows come and go, and we'll never actually find the end of the rainbow'.",
   "She2 continued, 'Rainbows are fleeting and last only several minutes'",
   "Char2 said, 'I'm going to stop here and enjoy the beauty of the rainbow from here'.",
   "Char1 and char3 were strangely drawn toward the rainbow, so they continued across the field.",
   "As they arrived at the huge oak tree, the rain sprinkles stopped and the rainbow began to fade.",
   "They were winded from running across the field.",
   "Char1 commented that the trunk of the tree was huge.",
   "Char2 pointed as char1 read the carving on the tree.",
   "'Skippy'",
   "Skippy?",
   "Could it be?",
   "As Char1 was1 telling char3 about char6's childhood love for her6 old dog Skippy, char2 arrived.",
   "Char2 noticed and old faded red and blue collar strapped around a limb half way up the tree.",
   "They agreed this was likely Skippy's final resting place.",
   "The next day, char1 told char6 about the carving, and the red and blue collar on the tree.",
   "Char6 stopped and looked at char1 and asked 'Was there a rainbow?'",
   "Char6 said she6 and her father had buried Skippy in 1954 under an old oak tree under a rainbow.",
   "Under a rainbow?",
   "How could that be?",
   "Could the rainbow of 1954 have been the same rainbow char1, char2 and char3 had chased yesterday?",
   "Char6 softly started whispering to herself.",
   "Char1 walked closer where he1 could hear char6.",
   "Char6 was6 quietly singing to herself.",
   "'Red, orange, yellow.",
   "Green and blue.",
   "Indigo,",
   "and you know,",
   "there's violet too.'",
   "Char1 moved closer and softly joined her.",
   "'Red, orange, yellow.",
   "Green and blue.",
   "Indigo,",
   "and you know,",
   "there's violet too.'",
   " ",
   "The End",
   "Written by, Kibity"
 ]
}
