{
 "line": [
    "Hotel Caledonia",
    "It was a chilly, overcast day in city1",
    "A beautiful eagle flew overhead as char1 and char2 jumped on their bikes and headed to char3's house.",
    "They were headed to char3's to make some cash.",
    "char3's grandfather, Paw Paw, would give them each a dollar to help wash his red 1969 Volkswagen Beetle",
    "Plus, they always looked forward to the Twizzlers Paw Paw would divide amongst them.",
    "Paw Paw said: 'This old Volkswagen is like living in a past I can never leave'.",
    "He continued: 'This thing still rides like a Mercedes Benz'",
    "As usual, Paw Paw talked about the old haunted castle back behind Calendonia Park",
    "Paw Paw had told them many times about the cold, shadowy path that led back to the old mansion.",
    "It was last used as a hotel, but now was run-down and neglected.",
    "He said once you see the place, you cannot turn back.",
    "He said: 'Today is a perfect day for you three to go check it out'.",
    "But he reminded them: 'You can never un-see what you've already seen'.",
    "He often spoke in sentences that hardly made any sense to them",
    "Paw Paw said you have to climb on top the wall surrounding the hotel, grab a vine and swing into the broken-out window on the left side of the castle.",
    "He told of the mirrors overhead, and a dining room table that is still perfectly prepared for a feast.",
    "He said the place is old, scary, yet lovely.",
    "Paw Paw always followed that up with: 'Such a lovely place, such a lovely face'.",
    "The three wondered what Paw Paw meant by that.  What face?",
    "Paw Paw reminded them of the legend: 'The only way to escape is to dance on the patio at the end of a long corridor.'",
    "The three decided to overcome their fears and visit the old haunted hotel.",
    "Yes, today was the day.",
    "They rode their bikes to Calendonia Park.",
    "As they parked their bikes, char3 said, 'Hey, I think Paw Paw forgot to give us Twizzlers.",
    "They were shaking as they began their walk down the shadowy pathway into the woods.",
    "They could feel a cool wind in their hair.",
    "There was a strange, warm, smell of flowers as the castle came into view.",
    "char2 said: 'Whoa, there's a lady in the doorway of the hotel.'",
    "All three gasped.",
    "'She's beautiful', said char2",
    "The fog suddenly increased as their view of the castle and the lovely lady grew dim.",
    "They turned to run in the opposite direction, as a thicker cloud of fog engulfed them.",
    "They could hear the lady whispering: 'Welcome to the Hotel Caledonia'.",
    "She was whispering, yet it was loud.",
    "They ran faster.",
    "Yet, strangely, the castle was in front of them again.",
    "Each direction they ran, the wall and castle appeared before them.",
    "And each time, the wall and castle were closer.",
    "Paw Paw was right",
    "They could not escape.",
    "They could not turn back.",
    "They had to climb the wall.",
    "Once on top the thick, stone wall, they could see vines hanging from a huge oak tree to the left of the castle.",
    "char2 headed left along the top of the wall.",
    "char1 and char3 followed.",
    "char2 knew what to do.",
    "char2 grabbed a vine, ran along the top of the wall. He2 bravely swang out.",
    "The vine magically took char2 towards the old hotel and thru a dark, empty window.",
    "char2 vanished.",
    "It seemed like forever went by.",
    "Finally, thru the fog, they hear char2 yell: 'Come on, grab a vine, come on'.",
    "char3 grabbed the other two thick vines.",
    "char1 said: 'Please bring me my vine'.",
    "The two ran along the top of the wall and took the leap of faith together.",
    "Toosh.",
    "Toosh.",
    "char1 and char3 released the vines as they dropped into the castle.",
    "Wow.",
    "What a nice surprise",
    "char1 said: 'no matter what happens, we've got each others' back. We're each others alibi",
    "As they looked up, they could see their reflection.",
    "There were mirrors on the ceilings.",
    "The mansion had a musty smell like stink on mice.",
    "It was dark. But char3 found and lit a candle to show them the way.",
    "'Wait, what's that noise?'",
    "They could hear ghostly voices and music from somewhere down the hall.",
    "The place was strange, yet had such beauty.",
    "As Paw Paw would say: 'Such a lovely place'.",
    "Now they remembered, the lady in the doorway had a lovely face",
    "Everything Paw Paw had said was coming true",
    "Char2 placed the candle on a mantle above a huge, stone fireplace",
    "Thru the twisted cobwebs was an old faded painting of a red Volkswagen.",
    "Char1 chuckled, 'I bet that thing drives like a Mercedes Benz'.",
    "They were scared, yet something led them towards the music down the hall",
    "As they past the dining room, they could see the table was perfectly set with silverware, steely knives, and chalices",
    "The air along the floor was cold and chilled their feet.",
    "yet each of them felt a warmth and comfort in their sole.",
    "Char3 said 'I feel strangely relaxed and welcome at Hotel Calendonia'",
    "'Yes, I'm also suddenly relaxed and welcome at Hotel Calendonia', said char2.",
    "At the end of the corridor was a door to an outdoor courtyard.",
    "They opened the door, and the music overwhelmed them.",
    "They could not still their feet.",
    "They began to dance uncontrollably.",
    "The fog rolled in and darkened the courtyard.",
    "They could hardly see their hands in front of their faces",
    "They started to run back towards the door as the fog was lifting.",
    "The next thing they knew they were back on the shadowy pathway they were before.",
    "They jumped on their bikes and headed back to tell Paw Paw about Hotel Calendonia.",
    "They were peddling so hard, a warm summer sweat dripped from their brows.",
    "On the windshieled of the red 1969 Volkswagen was a hand-written note from Paw Paw.",
    "'Some dance to remember, some dance to forget'.",
    "'What does this note mean?', said char2.",
    "Char1 said, 'I don't know, but my feet are still cold. It's like I haven't left Hotel Calendonia'.",
    "'I know', said char2, 'it's like I'm still there'",
    "char3 said: 'I think I know what the note means'.",
    "Remember that dance we did together?  I will never forget that",
    "And since we danced together, we will never forget the good times we've had as friends.",
    "Yes, 'Friends forever', said char2.",
    "'Hey look', said char1, 'Paw Paw left some Twizzlers here for us to divide'",
    "'Yahoo'",
    "'Twizzlers !!'",
    "'I knew Paw Paw would remember. He never forgets'",
    " ",
    "The End",
    "Written by, Cricket Allen"
   ]
}
