{
  "line": [
    "Lamb's Tail",
    "It was Saturday morning.",
    "The sun was already up.",
    "char1 was1 just starting to wake up.",
    "Petname1 was on the bed and ready to start the day.",
    "As char1 sat up, yawned, and stretched, Petname1 began jumping up and down, and running circles on the bed.",
    "char1 slipped out of the bed, and just like char4 had always suggested, char1 attempted to make the bed.",
    "This was a little difficult, because petname1 thought this was play time.",
    "petnam1 tugged at the covers, as char1 pulled and pushed in an attempt to make the bed.",
    "Finally, char1 won the battle and was able to make.",
    "char1 raced into the bathroom to get dressed.",
    "petname1 followed, as usual.",
    "char1 and petname1 found char4 in the kitchen making breakfast.",
    "This was char1's favorite meal of the day on Saturday, because char4 always made french toast and bacon.",
    "char1 loved french toast with lots of maple syrup.",
    "Usually when char4 was4 not looking, char1 would slip petname1 a bite or two.",
    "While waiting for breakfast to be served, char2 came into the kitchen and sat down at the table.",
    "Shortly after, char5 joined them at the table.",
    "char5 had a big smile",
    "he5 said, 'After all the Saturday morning chores are completed today, I have a big surprise.'.",
    "char1 and char2 asked, 'What is the surprise?'.",
    "char5 said, 'I will tell you in three shakes of a lamb's tail.'.",
    "char1 and char2 looked at each other puzzled.",
    "char2 asked, 'What does 'Three shakes of a lamb's tail' mean?'.",
    "char5 and char4 both smiled as they looked at each other.",
    "char5 replied, 'It means when the lamb shakes its tail three times.'.",
    "char1 and char2 were still puzzled.",
    "char1 asked, 'How will we know when the lamb shakes its tail?'.",
    "char5 again smiled, looking at char1 and char2, and said, 'I’ll let you know when the lamb shakes its tail.'.",
    "Just then, char4 placed a plate of french toast on the table along with a plate of bacon.",
    "Everyone began scooping up french toast and bacon onto their plates.",
    "They poured maple syrup over the french toast.",
    "While eating, char2 asked, 'Has the lamb shaken its tail yet?'.",
    "char5 replied, 'He's thinking about it.'.",
    "char1 and char2 once again looked puzzled.",
    "char4 could only giggle.",
    "After breakfast, char1 and char2 got up from the table and began their 1st chore of the day: Rinsing dishes and stacking the dishes in the dishwasher.",
    "char1 and char2 could not decide what was more important, the surprise or when the lamb shook its tail.",
    "Just as the dishes were being finished char5 came into the kitchen and said, 'The lamb has shaken its tail one time.'.",
    "char1 and char2 jumped up and down with joy!",
    "char5 said, 'The next chore for the day is to gather all of the dirty clothes and dirty towels in the bathrooms,",
    "And remove all of the sheets from the beds and pile everything in the laundry room.'.",
    "char1 looked at char2 and said, 'I’ll take care of all the sheets from the beds, and char2, you get the rest.'.",
    "They raced around the house with petname1 following to gather all of the dirty clothes, towels and linens.",
    "char1 started in char4 and char5’s room.",
    "char5’s bed was huge.",
    "char1 always loved this huge bed.",
    "When no one was looking char1 would climb up on the bed and jump around like it was a trampoline.",
    "But on this day, char1 decided not to jump, but instead to hurry and get the sheets off the bed.",
    "After removing the sheets, char1 noticed a catalog on char5's side of the bed.",
    "The catalog was open to a page that had sleek bicycles on it.",
    "char1 had been asking for a bike for over a year.",
    "Maybe char5 was5 thinking about it. char1 could only hope.",
    "While char1 stripped the sheets off of all the beds and took them into the laundry room,",
    "char2 gethered all the towels from both bathrooms, as well as the dirty clothes from the laundry baskets.",
    "she2 raced to take everything into the laundry room.",
    "char1 and char2 met in the laundry room, and it was obvious the excitement was building.",
    "char2 asked char1, 'what do you think the surprise is?'.",
    "char1 said, 'I don’t know but it doesn’t matter if the lamb doesn’t shake its tail two more times.'.",
    "Just then char5 stepped around the corner into the laundry room and said, 'The lamb shook its tail one more time.'.",
    "char1 and char2 jumped up and down with excitement.",
    "This was totally awesome!",
    "The lamb had to shake its tail only 1 more time!",
    "char5 said, 'The final chore of the day was for char1 and char2 to go outside and sweep the carport, the front porch, and walkway.'.",
    "char1 and char2 looked at each other, and their smiles became frowns.",
    "char1 said, 'That’s going to take all day.'.",
    "char2 asked, 'Can we stop if the lamb shakes its tail the third time?'.",
    "char5 replied, 'Yes, you can stop when the lamb shakes its tail the third time.'.",
    "char1 and char2 screamed with joy as they raced out of the house and found two brooms.",
    "char1 said, 'I’ll sweep the carport, you take the front porch and walkway.'.",
    "char1 said, 'We’ll sweep until we meet in the middle.',",
    "char1 and char2 began their sweeping chore.",
    "char1 began sweeping by the back door, and sweeping the dirt and leaves out of the carport.",
    "The wind began to blow, and seemed to blow the dirt and leaves back into the carport.",
    "char1 again began sweeping the dirt and leaves out of the carport, and again the wind blew it right back into the carport.",
    "char1 thought, 'This is going to take all day!'.",
    "But char1 remembered what char5 had said, 'You can stop when the lamb shakes its tail the 3rd time.'.",
    "char2 was2 having the same problem.",
    "It seemed for each sweep of the broom, the wind would blow, and the dirt and leaves were right back where they started.",
    "char2 began to cry with disappointment for fear of not being able to finish the chore.",
    "char1 heard char2.",
    "char1 walked around the corner  and saw char2 crying.",
    "char1 asked, 'What is wrong?'.",
    "'Why are you crying?'",
    "char2 said, 'Every time I sweep the dirt and leaves off the porch, the wind blows it right back in place onto the porch'.",
    "Suddenly char5 appeared.",
    "Both char1 and char2 looked up.",
    "char5 said, 'Guess what?'.",
    "char1 and char2 smiled and said, 'What?'.",
    "char5 said, 'The lamb just shook its tail for the 3rd time.'.",
    "At the same moment, char4 walked up.",
    "She4 and char5 looked at each other.",
    "char5 said, 'Let’s all hop into the car, because we have somewhere to go.'.",
    "char1 and char2 dropped their brooms, and both raced to jump into the back seat of char5’s truck.",
    "As char4 and char5 got into the front seats of the truck, char2 asked 'what’s the surprise?'.",
    "char4 turned her4 head and smiled and said, 'You’ll both see soon enough.'.",
    "They drove for about 20 mins when char5 pulled up and parked at the Walmart parking lot.",
    "Everyone jumped out of the truck and proceeded into Walmart.",
    "While walking in char1 and char2 were trying to guess what the surprise was.",
    "char4 and char5 continued to smile. Yet they wouldn’t give a hint as to what was the surprise.",
    "They all walked to the back of the store to an area with a sign that read 'Order Pick Up'",
    "char5 told the lady at the counter they were there to pick up an order.",
    "After giving their name, the lady looked it up in the computer",
    "Suddenly she looked up, and looked at char1 and char2 with a big grin.",
    "As she looked at char1 and char2 she said, 'This is your lucky day'",
    "She walked through some swinging doors, and a few minutes later she came out with two gigantic boxes on a cart.",
    "She looked at char5 and said, 'Will you need help with these?'.",
    "char5 said, 'As long as the boxes were on the cart he5 could handle it.'",
    "char1 and char2 still could not figure out what was in the two gigantic boxes.",
    "They all followed char5 as they took the cart with the two gigantic boxes out to the parking lot",
    "char5 managed to get both boxes placed securely into the back of the truck.",
    "char5 took the cart back inside the store, and they all climbed back into the truck to head home.",
    "On the way home, char1 and char2 tried guessing what was the surprise in the two gigantic boxes.",
    "char1 asked, 'What is the surprise made of?'.",
    "char5 answered, 'The surprise is metal, plastic, and rubber.'.",
    "Neither char1 or char2 could figure out what it could be.",
    "char2 asked, 'what color is it?'",
    "char4 relied,  'The surprise is several colors'.",
    "Again char1 and char2 couldn’t imagine what it was.",
    "Finally they arrived at home.",
    "char1 and char2 were ecstatic.",
    "They could barely wait to get out of the truck.",
    "char5 put the truck in park and everyone jumped out.",
    "They gathered around the back of the truck as char5 pulled the tailgate down and pulled the boxes out and onto the ground.",
    "char5 finally began to open the gigantic boxes.",
    "Suddenly char1 saw a handle bar and realized what the surprise was.",
    "char1 was1 about to shout out what it was when char4 put her4 finger to her4 lips and motioned not to say anything quite yet.",
    "char1 was1 beaming with excitement.",
    "char5 continued to unbox the surprise.",
    "Suddenly char2 saw a foot petal.",
    "char2 mouth fell open.",
    "char2 looked at char1 and screamed, 'They’re bicycles!!!!!!!!!!!!!!'.",
    "Both char1 and char2 were screaming and jumping with joy.",
    "char4 and char5 both laughed.",
    "This is what char1 and char2 had been wishing for over a year, and of course, for three shakes of a lamb's tail.",
    " ",
    "The End",
    "Written by, Cricket Allen"
  ]
}