{
 "line": [
   "New Friend",
   "It was Saturday morning bright and early.",
   "Suddenly char1 awoke when char4 leaned into the bedroom and said, 'It’s time to get up.'",
   "'Today is moving day.'",
   "char1 sat up in bed, stretched, and yawned, and suddenly realized today they were going to move to their new house across town.",
   "char1 jumped out of bed, got dressed, brushed his1 teeth, and headed to the kitchen.",
   "char4 had char1’s favorite cereal in a bowl with milk, and sliced bananas on top.",
   "As char1 ate, she1 asked char4, 'Would they be able to sleep in the new house tonight?'",
   "char4 replied, 'That is the plan.'",
   "char4 told char1, 'The movers are on their way.'",
   "Soon they would be moving everything into the moving truck, and taking it over to the new house.",
   "char1 made sure all of his1 favorite dolls and stuffed animals were properly boxed, and gently placed into the moving truck.",
   "It took several hours, but finally everything was loaded.",
   "char1 climbed into the car with char4 and char5 as they pulled out to follow the moving truck.",
   "Once they arrived at the new house, char1 jumped out of the car, and began to watch as everyone got busy unloading the boxes and furniture.",
   "What a sight.",
   "The new house was yellow with black shutters.",
   "It had a big pecan tree in the front yard, and several more in the back yard.",
   "char4 said, 'Once we get settled, we will build char1 a playhouse in the back yard under the trees.'",
   "char1 was excited at the thought of having his1 very own play house.",
   "At the moment, though, there wasn’t much to do, but stay out of the way, and watch everyone take boxes and furniture into the new house.",
   "char4 acted like a traffic cop directing everyone on where to put each box and each piece of furniture.",
   "In the meantime, char1 walked around outside exploring.",
   "Suddenly char1 noticed across the street was a house with what appeared to be a kid peering out of the window.",
   "char1 waved hello, and the kid in the window waved back.",
   "char1 smiled with excitement at the thought of a possible new friend to play with.",
   "char1 turned around to suddenly see the box which contained his1 dolls and stuffed animals being taken out of the moving truck.",
   "he1 ran over and asked char4 if she1 could get some dolls out to play with.",
   "char4 replied, 'That is a great idea.'",
   "char1 was able to open the box and get two dolls out.",
   "She1 quickly took the two dolls, and sat under the pecan tree to play with them.",
   "char1 noticed the kid from across the street was now outside on the front porch.",
   "char1 got up, and asked char4, 'Is it ok to go across the street to meet the new kid.'",
   "char4 said, 'Most certainly, but be sure to look both ways before crossing the street, and stay where I can see you.'",
   "char1 was excited",
   "she1 looked both ways before crossing the street, and walked over to the house.",
   "char1 walked up to the front porch, and noticed the kid was sitting in a wheelchair.",
   "char1 said, 'Hi, my name is char1.'",
   "'We are moving in today.'",
   "'Hi, my name is char2.'",
   "'I live here.'",
   "char1 said, 'Here are two of my favorite dolls, wanna play?'",
   "char2 smiled and said, 'Sure!'",
   "char1 sat in a chair beside char2, and the two began to play together with the two dolls.",
   "char1 and char2 learned a lot about each other while they were playing dolls.",
   "char1 told char2 all about where she1 use to live, and what his1 old school was like.",
   "char2 told char1 all about the school she2 attended, and his2 favorite subjects and things to do.",
   "The two played for hours.",
   "char2’s Mom came out and introduced herself.",
   "She brought both of them some milk and cookies to enjoy.",
   "After some time had gone by, both noticed the moving truck drive away.",
   "Shortly thereafter, char1's char4 came walking across the street, and up to the front porch.",
   "She4 introduced him4self to char2.",
   "char2’s Mom came outside and said, 'Hello', and introduced herself to char1's char4 and vice versa.",
   "Everyone chatted for a few minutes. Then char1's char4 said, 'Well, char1 needs to come home now so we can eat dinner, and then get ready to settle down for the evening.'",
   "char1's char4 said, 'It has been a long day, and tomorrow along with the next week will continue as we get everything settled.'",
   "char1 got up and slid his1 hand into his1 char4's hand.",
   "he1 turned around to char2, and said 'This has been fun today, do you want to play again tomorrow?'",
   "char2 smiled and said, 'I sure would.'",
   "char2’s Mom and char1's char4 both smiled, and both agreed as well.",
   "As char1 and his1 char4 walked back across the street, char1 told his1 char4 all about his1 new friend.",
   "She1 told his1 char4 that char2 had always been in a wheelchair, but it didn’t stop him2 from anything.",
   "char1 said, 'char2 can play basketball, she2 goes shopping with his2 Mom, and she2 can do everything we do.'",
   "char1's char4 just smiled, and was so pleased with char1’s new friend.",
   "It was shortly after dinner, char1 got his1 bath and char4 tucked him1 into bed.",
   "char1 told his1 char4, 'I’m really excited to sleep in our new home tonight, but I think I'm more excited about my new friend.'",
   "char4 kissed char1 on her forehead, told him1 good night, and turned out the light as she4 closed the bedroom door.",
   "char1 drifted off to sleep thinking about his1 new friend, and what dolls she1 would take over to char2’s house the next day, and what games they would play.",
   " ",
   "The End",
   "Written by, Cricket Allen"
   ]
}
