{
 "line": [
    "The Pecan Tree",
    "mainchar lived in a small house in the country",
    "she1 had a brother named secondchar and a car named PetName1",
    "It was almost the end of the school year and mainchar could not wait to be out of school",
    "The end of the school year meant summer vacation, sleeping late in the morning, not having to do homework, and best of all getting to play.",
    "On the last day of school, mainchar along with all her1 classmates gathered all their yearlong school projects, supplies, and backpacks to take home.",
    "Everyone in the school met in the gymnasium for one last school activity.",
    "Everyone sang the school song, said farewell to their friends and teachers and then headed home.",
    "The next morning, mainchar woke up and jumped out of bed in fear of being late to school when suddenly the realization of the first day of summer vacation hit.",
    "Yippie !!",
    "It's summer vacation and mainchar did not have to go to school.",
    "mainchar jumped back into bed and attempted to go back to sleep.",
    "After a few minutes and no sleep, mainchar climbed out of bed and proceeded to make his1 way to the den and turn on the TV.",
    "Once the cartoons were on, mainchar stumbled into the kitchen to grab a box of cereal, a bowl, and milk.",
    "Finally settling onto the den floor to eat a bowl of cereal while watch cartoons.",
    "After a while when the cereal was gone and the cartoons were going off, mainchar got dressed and went outside.",
    "mainchar's best friend, thirdchar, was leaving to go to the beach with his3 parents for a week.",
    "They were loading up the car with luggage, and shortly after waving goodbye they were on their way.",
    "mainchar looked around and decided to climb up into the Pecan Tree in the front yard.",
    "she1 sat on the perch of one of the largest branches of the pecan tree.",
    "she1 could see a far distance across the field in one direction, past several houses in the other direction.",
    "mainchar leaned back on the branch and looked up into the sky.",
    "she1 could see the puffy white clouds dancing across the sky.",
    "One cloud looked like a dog running.",
    "Suddenly a bird flew over and landed on a branch nearby on the same pecan tree.",
    "The bird hopped over and into a bird's nest.",
    "mainchar could see the bird had something wiggling in its mouth.",
    "Suddenly the bird placed the wiggly thing into another much smaller little mouth.",
    "Wow, it was a baby bird.",
    "mainchar sat for a while watching as the bird would leave and come back with more worms and bugs to feed the baby bird.",
    "Before long mainchar saw secondchar ride up on her1 bicycle.",
    "secondchar got off of her1 bike and casually walked over to the Pecan Tree and climbed up onto a different branch.",
    "They chatted about what was going on in the neighborhood, about the new puppies the neighbor's dog had earlier that week, and about building a fort in the woods.",
    "But, of course, this would have to wait till after lunch.",
    "Both mainchar and secondchar jumped down from the Pecan Tree and ran into the house to see who would be the first to make a peanut butter and jelly sandwich.",
    "While eating the peanut butter and jelly sandwiches, mainchar and secondchar talked about plans for building a fort in the woods behind the house.",
    "They knew where there were some old boards and pieces of wood, in addition to a large box from the new washing machine Mrs Anderson put outside into the trash.",
    "This would all be perfect to build a fort with.",
    "mainchar would bring some scissors and crayons to draw windows and a door if needed.",
    "Once lunch was finished and clean up complete, mainchar and secondchar set out to gather the materials and headed toward the woods to find the perfect spot to build the fort.",
    "After much looking and discussion they decided the best place for the fort would be in the front yard in the big Pecan Tree.",
    "So they built a fort in the tree with boards laid across the large branches and the big washing machine box on top taped down to the boards.",
    "They used the scissors to cut out windows and a door they could enter and close when needed.",
    "They even cut out a sky light so they could watch the baby bird eat and grow.",
    "The fort was perfect!",
    "No one would know where they were when they were in inside the fort.",
    "mainchar and secondchar were so proud.",
    "Soon other kids in the neighborhood had forts as well.",
    "It became a competition of who had the best fort.",
    "One evening when everyone was in bed a bad rain storm came crashing through.",
    "The next morning when mainchar and secondchar woke up they hurried outside to find their fort had blown away.",
    "The fort was nowhere to be found.",
    "Not only had the fort blown away, but the bird's nest with the baby bird was gone as well.",
    "mainchar and secondchar were heart broken.",
    "All of their hard work and dreams blown away in one night.",
    "mainchar climbed back up into the tree and once again sat upon the largest branch.",
    "mainchar sat and gazed up into the sky watching birds fly over and the clouds pass by.",
    "All of a sudden mainchar heard a car door slam.",
    "When mainchar looked over, thirdchar was home from summer vacation and ran over to climb up into the Pecan Tree with mainchar to tell mainchar all about what had happened while on summer vacation.",
    "The two sat in the Pecan tree for hours laughing and talking.  Guess that Pecan tree has heard many. many a tales over the years.",
    " ",
    "The End",
    "Written by, Beth Allen"
   ]
}
