{
 "line": [
    "Summer vacation at Grandmothers",
    "Mainchar was excited, she1 was planning to spend a whole week by herm1self at her1 grandmothers house for summer vacation this year.",
    "she1 had never done this before and she1 could hardly wait. Tomorrow morning Mainchar's mother would take herm1 and drop herm1 off.",
    "Mainchar's grandmother lived up in the Appalachian mountains of North Carolina down a dirt road.",
    "Mainchar could always remember her1 grandmothers warm smile and her little dog named Lucky.",
    "Grandma said she named him Lucky, because he was lucky she had found him when he was just a puppy.",
    "Lucky went everywhere Mainchar's grandmother went.",
    "Mainchar could hardly sleep that night.",
    "When her1 mother woke herm1 the next morning, Mainchar jumped out of bed and quickly got dressed.",
    "she1 gathered her1 most prized possessions, her1 cell phone, her1 Xbox, her1 Tablet, and of course, her1 stuffed rabbit, Mr Pibbs.",
    "she1 had had since she1 could remember. These things should keep herm1 occupied while she1 was away.",
    "Mainchar and her1 mother drove for almost three hours until they finally reached her1 grandmothers house.",
    "Lucky greeted them at the car door while Mainchar's grandmother waved from the front porch.",
    "After unloading the car, Mainchar, her1 mother, and her1 grandmother sat down at the kitchen table for lunch which Mainchar's grandmother had already prepared.",
    "There were Mainchar's favorites. Fried chicken, fresh corn on the cob, and home made biscuits and gravy.",
    "While Mainchar's mother and grandmother talked, Mainchar slipped Lucky a biscuit.",
    "Mainchar grinned at getting away with it without being noticed.",
    "After lunch, Mainchar's mother left for home, and Mainchar and her1 grandmother set out to clean up the lunch dishes.",
    "Mainchar's grandmother didnt have a dishwasher so she washed the dishes by hand, and she let Mainchar dry them.",
    "Once the kitchen was cleaned up, Mainchar's grandmother suggested to rest a bit before heading into town.",
    "Mainchar was staying in the front bedroom. It had a big feather bed. when Mainchar jumped on the bed, it was like sinking into a cloud.",
    "Mainchar's grandmothers house didnt have air conditioning, so Mainchar's grandmother placed a fan on the dresser, pointed it towards the bed, and turned it on.",
    "mainchar's grandmother turned away and closed the bedroom door behind her. leaving Mainchar to rest after her1 long trip.",
    "Mainchar was not tired though. she1 dug out her1 Tablet and proceeded to turn it on. To Mainchar's surprise, it displayed, No Internet Connection.",
    "Mainchar got her1 cell phone out, it also showed 'No Service'",
    "Mainchar looked around the bedroom and there was no TV for the XBox. she1 slipped out of the bedroom and noticed there was not a TV in the house.",
    "Panic set in for Mainchar.",
    "What was she1 suppose to do all week with no cell phone access, no internet access, no XBox?",
    "She1 laid across the bed as tears streamed down her1 face. Soon after she1 drifted off to sleep.",
    "she1 awoke suddenly when Lucky jumped on the bed.",
    "Mainchar's grandmother stood at the door smiling, and told herm1 she1 was welcome to keep sleeping, but if she1 wanted to go with her to town, she1 would need to get up.",
    "Mainchar's grandmother did not have a car. She always walked to town.",
    "So on this day, just like any other day, Mainchar's grandmother and Lucky, along with Mainchar, walked down the dirt road.",
    "It was just a short distance to town. Along the way Mainchar saw a stream with several deer crossing it.",
    "There were squirrels chasing each other around a huge maple tree.",
    "There were also several cows that looked like Oreo cookies, because although they were black, they had a white band that went around their stomachs.",
    "Mainchar's grandmother said they were called Belted Galloway, cows. Mainchar thought they were pretty.",
    "Once in town, their first stop was at the general store. There were all kinds of things in the store.",
    "While Mainchar's grandmother shopped, Mainchar walked around and looked at everything.",
    "As Mainchar walked around she1 noticed in a glass case several beautifully colored stones.",
    "Some were smooth and shiny, others were ruff. There were many colors. One even had gold glitter.",
    "All of a sudden someone said, you must be Mainchar.",
    "Mainchar quickly turned around and it was an older gentleman. He said his name was Sam, and he was the owner of the general store.",
    "Sam told Mainchar she1 was looking at his prize gem stones he had personally found when he was younger.",
    "He told Mainchar what type each was and where he had found each one.",
    "He also told herm1 the one with gold glitter was really gold. He said he found it while fishing the Raven Fork river when he was 19 years old.",
    "This is what started his love for hunting gem stones. Mainchar was certainly intrigued.",
    "Once Mainchar's grandmother finished shopping and gathered her purchased goods, she told Mainchar they needed to head home as they had a lot to do.",
    "On the walk back, Mainchar told her1 grandmother all about meeting Sam, and about each and every stone she1 had seen behind the glass case.",
    "Before she1 knew it they were back at her1 grandmother's house.",
    "Mainchar's grandmother put her groceries up, and she told Mainchar they need to go out into the garden to pick vegetables for dinner.",
    "Mainchar's grandmother's garden was beautiful. Mainchar had never actually been in a garden before.",
    "There were tomatoes, green beans, radishes and so much more. It was amazing!",
    "Mainchar never realized where vegetables actually came from.",
    "she1 helped to pick green beans, cucumbers, tomatoes and squash. she1 had a basket full.",
    "Mainchar noticed how good the garden smelled, and the sunshine felt good as it shined.",
    "Mainchar's grandmother said the sunshine was liquid gold, and that, along with the rain, is what made the garden grow.",
    "After dinner, Mainchar, her1 grandmother, and Lucky, sat on the front porch swing and listened to the frogs and crickets.",
    "Mainchar's grandmother told herm1 stories of when she was Mainchar's age, and what it was like growing up.",
    "Soon Mainchar found it hard to keep her1 eyes open as her1 grandmother helped her1 climb into bed.",
    "Before Mainchar knew it, the week had flown by and it was Saturday.",
    "Mainchar knew her1 mother would be coming that afternoon to pick herm1 up.",
    "Mainchar had grown fond of spending time with her1 grandmother",
    "Fond of learning how to cook,",
    "Fond of the smell of bacon cooking in the morning, picking vegetables in the garden, swinging on the front porch swing, and playing with Lucky.",
    "She1 had forgotten about her1 cell phone, XBox, and Tablet.",
    "Mainchar heard Lucky barking as a car drove up. she1 looked out the front door and it was Sam.",
    "He came up to the front door with a box.",
    "He told Mainchar he enjoyed meeting herm1, and talking with her1 about his memories of hunting for gem stones.",
    "He handed herm1 the box, and told herm1 he was giving herm1 his collection of gem stones.",
    "He said he did not have any family, and he wanted someone who would appreciate them as much as he did.",
    "Mainchar was shocked beyond words.",
    "she1 had never received anything this special before.",
    "she1 gave Sam a hug, and thanked him for giving her1 the gem stone collection.",
    "she1 told him she1 looked forward to seeing him again next year when she1 would return again for summer vacation.",
    "The trip home, although 3 hours, flew by as Mainchar told her1 mother all the details of her1 week",
    "Mainchar told her mother about all the new things she1 had learn to do with her1 grandmother.",
    "Mainchar said she1 would cook her1 mother dinner when they got home.",
    "When mainchar and her mother arrived home, Mainchar did what she said.",
    "Mainchar cooked scrambled eggs"
  ]
}