{
 "line": [
    "Summer vacation at Grandmother's",
    "char1 was1 excited.",
    "She1 was1 planning to spend a whole week by herm1self at her1 grandmother's house for summer vacation this year.",
    "char1 had never done this before.",
    "she1 could hardly wait.",
    "Tomorrow morning parent1 would take herm1 and drop herm1 off.",
    "Her1 grandmother lived up in the Appalachian mountains of North Carolina down a dirt road.",
    "she1 could always remember her1 grandmother's warm smile and her little dog named Lucky.",
    "Grandma said she named him Lucky, because he was lucky she had found him when he was just a puppy.",
    "Lucky went everywhere char1's grandmother went.",
    "char1 could hardly sleep that night.",
    "When parent1 woke herm1 the next morning, char1 jumped out of bed and quickly got dressed.",
    "char1 gathered her1 most prized possessions, her1 cell phone, her1 X-Box, her1 Tablet, and of course, her1 stuffed rabbit, Mr Pibbs.",
    "She1 had had Mr Pibbs since she1 could remember. These things should keep herm1 occupied while she1 was1 away.",
    "parent1 and char1 drove for almost three hours until they finally reached her1 grandmother's house.",
    "Lucky greeted them at the car door, while char1's grandmother waved from the front porch.",
    "After unloading the car, char1, parent1, and char1's grandmother sat down at the kitchen table for lunch, which char1's grandmother had already prepared.",
    "She had prepared char1's favorites.",
    "Fried chicken, fresh corn on the cob, and home made biscuits and gravy.",
    "While parent1 and grandmother talked, char1 slipped Lucky a biscuit.",
    "char1 grinned at getting away with it without being noticed.",
    "After lunch, parent1 left for home, and char1 and her1 grandmother began to clean up the lunch dishes.",
    "char1's grandmother didnt have a dishwasher so she washed the dishes by hand, and she let char1 dry them.",
    "Once the kitchen was cleaned up, char1's grandmother suggested to rest a bit before heading into town.",
    "char1 was1 staying in the front bedroom. It had a big feather bed.",
    "When char1 jumped on the bed, it was like sinking into a cloud.",
    "Her1 grandmother's house didnt have air conditioning, so char1's grandmother placed a fan on the dresser, pointed it towards the bed, and powered it on.",
    "Her1 grandmother turned away and closed the bedroom door behind her. leaving char1 to rest after her1 long trip.",
    "However, char1 was1 not tired.",
    "she1 dug out her1 Tablet and proceeded to power it on. To char1's surprise, it displayed, No Internet Connection.",
    "She1 got her1 cell phone out, it also showed 'No Service.'",
    "char1 looked around the bedroom, and there was no TV for the X-Box.",
    "she1 slipped out of the bedroom and noticed there was not a TV in the house.",
    "Panic set in for char1.",
    "What was1 she1 suppose to do all week with no cell phone access, no internet access, no X-Box?",
    "char1 laid across the bed as tears streamed down her1 face. Soon after she1 drifted off to sleep.",
    "She1 awoke suddenly when Lucky jumped on the bed.",
    "Her1 grandmother stood at the door smiling, and told herm1 she1 was1 welcome to keep sleeping, but if she1 wanted to go with her to town, she1 would need to get up.",
    "char1's grandmother did not have a car. She always walked to town.",
    "So on this day, just like any other day, char1's grandmother and Lucky, along with char1, walked down the dirt road.",
    "It was just a short distance to town. Along the way char1 saw a stream with several deer crossing it.",
    "There were squirrels chasing each other around a huge maple tree.",
    "There were also several cows that looked like Oreo cookies, because although they were black, they had a white band that went around their stomachs.",
    "char1's grandmother said they were called Belted Galloway. char1 thought they were pretty.",
    "Once in town, their first stop was at the general store. There were all kinds of things in the store.",
    "While char1's grandmother shopped, char1 walked around and looked at everything.",
    "As char1 walked around, she1 noticed in a glass case several beautifully colored stones.",
    "Some were smooth and shiny. Others were ruff. There were many colors. One even had gold glitter.",
    "All of a sudden someone said, 'You must be char1?'",
    "char1 quickly turned around and it was an older gentleman. He said his name was Sam, and he was the owner of the general store.",
    "Sam told char1 she1, 'You are looking at my prize gem stones I found when I was younger.'",
    "He told char1 what type each was and where he had found each one.",
    "He also told herm1 the one with gold glitter was really gold. He said he found it while fishing the Raven Fork River when he was 19 years old.",
    "This is what started his love for hunting gem stones. char1 was1 certainly intrigued.",
    "Once char1's grandmother finished shopping and gathered her purchased goods, she told char1 they needed to head home as they had a lot to do.",
    "On the walk back, char1 told her1 grandmother all about meeting Sam, and about each and every stone she1 had seen behind the glass case.",
    "Before she1 knew it they were back at her1 grandmother's house.",
    "char1's grandmother put the groceries up, and she told char1 they need to go out into the garden to pick vegetables for dinner.",
    "Her1 grandmother's garden was beautiful. char1 had never actually been in a garden before.",
    "There were tomatoes, green beans, radishes and so much more. It was amazing!",
    "She1 never realized where vegetables actually came from.",
    "char1 helped to pick green beans, cucumbers, tomatoes and squash.",
    "she1 had a basket full.",
    "She1 noticed how good the garden smelled, and the sunshine felt good as it shined.",
    "char1's grandmother said the sunshine was liquid gold, and that, along with the rain, is what made the garden grow.",
    "After dinner, char1, her1 grandmother, and Lucky, sat on the front porch swing and listened to the frogs and crickets.",
    "Her1 grandmother told herm1 stories of when she was char1's age, and what it was like growing up.",
    "Soon char1 found it hard to keep her1 eyes open as her1 grandmother helped her1 climb into bed.",
    "Before char1 knew it, the week had flown by and it was Saturday.",
    "She1 knew parent1 would be coming that afternoon to pick herm1 up.",
    "char1 had grown fond of spending time with her1 grandmother",
    "Fond of learning how to cook.",
    "Fond of the smell of bacon cooking in the morning, picking vegetables in the garden, swinging on the front porch swing, and playing with Lucky.",
    "She1 had forgotten about her1 cell phone, X-Box, and Tablet.",
    "char1 heard Lucky barking as a car drove up.",
    "she1 looked out the front door. It was Sam.",
    "He came up to the front door with a box.",
    "He said to char1, 'I enjoyed meeting you, and talking with you about my memories of hunting for gem stones.'",
    "He handed char1 the box and said, 'I am giving you my collection of gem stones.'",
    "He said, 'I do not have any family, and I want someone who would appreciate them as much as he do to have them.'",
    "char1 was1 shocked beyond words.",
    "she1 had never received anything this special before.",
    "she1 gave Sam a hug, and thanked him for giving herm1 the gem stone collection.",
    "she1 told him, 'I am looking forward to seeing you again next year when I return again for summer vacation.'",
    "The trip home, although 3 hours, flew by as char1 told parent1 all the details of her1 week",
    "char1 told parent1 about all the new things she1 had learned to do with her1 grandmother.",
    "char1 said, 'I will cook you dinner when we get home.'",
    "When char1 and parent1 arrived home, char1 did what she said.",
    "char1 cooked scrambled eggs!!",
    " ",
    "The End",
    "Written by, Cricket Allen"
  ]
}