{
 "line": [
    "Uncle Ned's Fireworks",
    "char1 woke up this morning to a strange smell.",
    "char1 recognized the smell, but he1 could not quite remember where he1 had recently experienced it.",
    "As he1 was1 getting out of bed, parent1 called for him1 to come for breakfast. As char1 headed for the kitchen, the smell subsided.",
    "char1 looked outside, and his1 pet1 was laying next to the door as usual in the mornings.",
    "char1's pet1's eyes were excited to see char1 awake so early.",
    "Yes, char1 was1 up earlier than normal on this Saturday, as Today is the ribbon cutting grand opening event of the new bridge across the river.",
    "The bridge had been closed and under construction for twelve months since char2's uncle Ned was delivering fireworks to city hall for last years July 4th celebration.",
    "However, the rhythmic bumps in the bridge caused the truck to bounce in perfect tempo, triggering one firecracker to explode.",
    "All it took was one. The one firecracker ignited three others. Then ten others.",
    "char2 was2 riding with his2 uncle Ned that day.",
    "char2 tells of how they knew a chain reaction was about to occur, and they were able to duck into the nearby canal as the explosion doubled. Then tripled Then quadrupled. Then quintupled.",
    "The chain reaction continued as the entire truckload of fireworks exploded, taking out the bridge.",
    "char2 has told char1 many times how the smell of gunpowder will always bring back that memory of the explosion.",
    "Now, if only char1 could recall where he1 had experienced that strange smell from his1 bed this morning.",
    "Just as char1 was1 finishing his1 cereal, char1 received a secret message from char3.",
    "No one else knows about it, but char1, char2, and char3 have a secret, silent, method of communicating to each other.",
    "Yesterday, char2's uncle Ned had given each of them a new scientific gamma ray earpiece device.",
    "The gamma ray earpieces function similarly to iphones. The device is tiny and fits into your ear.  They are so tiny no one knows they are there.",
    "char3 had sent char1 a gamma ray message stating char3 was3 outside shooting peas through a straw at char1's pet1.",
    "char1 looked outside and his1 pet1 was sniffing his own butt, like normal.",
    "Then, unexpectedly, bam.",
    "his1 pet1 yelped and jumped.",
    "Yes, char3 was3 always good at shooting peas through a straw. char3's favorite ammo was black eyed peas.",
    "char3 would scientifically search through the entire bag of black eyed peas to find the perfect pea for his3 next shot.",
    "char1 had slept in his1 clothes, so he1 told char4 he1 was1 going to the river with char2 and char3 to get a good spot for the nine o clock bridge opening.",
    "char1 and char3 met up with char2 down at their favorite fishing spot. char2 thought he2 smelled gunpowder.",
    "char1 was1 trying to recall the strange smell from the bed.",
    "And char3, well, he3 could smell mashed wet peas on his3 hand, because he3 had slipped and gotten wet along the river, then stuck his3 hand into his3 pocket.",
    "Now char3's hand smelled of wet mashed peas.",
    "But, the one smell they all smelled was the river. And all three loved the smell of the river.",
    "The bridge was only a three minute walk down river. During the walk downstream, no one said a word aloud.  They were communicating through gamma rays.",
    "char2 once again told the story about the explosion.",
    "As usual, they listened intently. It was still the biggest story in town, especially the past few days as everyone anticipated the opening of the bridge.",
    "About the time they arrived at the path to go up to the bridge char2 startled a frog. char1 quickly and instinctively scooped the frog into his1 hands.",
    "The frog had a subtle yet distinct smell.",
    "The smell triggered his1 memory. 'Uh oh, uh oh', exclaimed char1. 'Uh oh, what?', said char2.",
    "char1 said, 'I know what that strange smell was this morning in my bed. Do you remember the frog we caught yesterday?  The one into my napsack'? They both responded, 'yes.'",
    "char1 said, 'Well, the frog is still in the napsack and the napsack is next to my bed'.",
    "They all agreed to go check on the frog.",
    "The entire walk back to char1's house, char3 was3 shooting wet mashed pea globs thru his3 straw at char1. Each glob of pea stuck to the back of char1's butt.",
    "Soon, they arrived to find the frog loudly croaking from within the napsack. They took the frog back to the river.",
    "char1's pet1 followed them to the river.",
    "When they set the frog free, the pet1 went to sniff where the frog jumped into the water, and that is when they saw a pea stuck in char1's pet1's butt.",
    "They headed up the path and arrived at the grand opening of the bridge.",
    "As they arrived, the mayor was handing a big set of scissors to char2's uncle Ned.",
    "As Uncle Ned cut the ribbon, char1 gamma rayed the other two and silently said, 'char3, you are still the best pea shooter in town.'",
    "char3 laughed and messaged back using gamma rays saying, 'char1, watch Uncle Ned's butt.'",
    "char3 snickered and loaded another mashed pea glob into his3 straw.",
    " ",
    "The End",
    "Written by, Kibity"
   ]
}