{
 "line": [
    "Uncle Ned's Fireworks",
    "mainchar woke up this morning to a strange smell.",
    "mainchar recognized the smell, but he1 could not quite remember where he1 had recently experienced it.",
    "As he1 was getting out of bed, his1 Mom called for him1 to come for breakfast. As mainchar headed for the kitchen, the smell subsided.",
    "mainchar looked outside and his1 pet1 was laying next to the door as usual in the mornings.",
    "mainchar's pet1's eyes were excited to see mainchar awake so early.",
    "Yes, mainchar was up earlier than normal on this Saturday, as Today is the ribbon cutting grand opening event of the new bridge across the river.",
    "The bridge had been closed and under construction for twelve months since secondchars uncle Ned was delivering fireworks to city hall for last years July 4th celebration.",
    "However, the rhythymic bumps in the bridge caused the truck to bounce in perfect tempo, triggering one firecracker to explode.",
    "All it took was one. The one firecracker ignited three others. Then ten others.",
    "secondchar was riding with his2 uncle Ned that day.",
    "secondchar tells of how they knew a chain reaction was about to occur, and they were able to duck into the nearby canal as the explosion doubled, then tripled, then quadrupaled. then quintupled.",
    "The chain reaction continued as the entire truckload of fireworks exploded, taking out the bridge.",
    "secondchar has told mainchar many times how the smell of gunpowder will always bring back that memory of the explosion.",
    "Now, if only mainchar could recall where he1 had experienced that strange smell from his1 bed this morning.",
    "Just as mainchar was finishing his1 cereal, mainchar received a secret message from thirdchar.",
    "No one else knows about it, but mainchar, secondchar, and thirdchar have a secret, silent, method of communicating to each other.",
    "Yesterday, secondchars uncle Ned had given each of them a new scientific gamma ray earpiece device.",
    "The gamma ray earpieces function similar to iphones. The device is tiny and fits into your ear.  They are so tiny no one knows they are there.",
    "thirdchar had sent mainchar a gamma ray message stating thirdchar was outside shooting peas through a straw at mainchar's pet1.",
    "mainchar looked outside and his1 pet1 was sniffing his own butt, like normal.",
    "Then, unexpectedly, bam. his1 pet1 yelped and jumped.",
    "Yes, thirdchar was always good at shooting peas through a straw. thirdchars favorite ammo was black eyed peas.",
    "thirdchar would scientifically search through the entire bag of black eyed peas to find the perfect pea for his3 next shot.",
    "mainchar had slept in his1 clothes, so he1 told his1 mom he1 was going to the river with secondchar and thirdchar to get a good spot for the nine o clock bridge opening.",
    "mainchar and thirdchar met up with secondchar down at their favorite fishing spot. secondchar thought he2 smelled gunpowder.",
    "mainchar was trying to recall the strange smell from the bed.",
    "And thirdchar, well, he3 could smell mashed wet peas on his3 hand, because he3 had slipped and gotten wet along the river, then stuck his3 hand into his3 pocket.",
    "Now thirdchars hand smelled of wet mashed peas.",
    "But, the one smell they all smelled was the river. And all three loved the smell of the river.",
    "The bridge was only a three minute walk down river. During the walk downstream, no one said a word aloud.  They were communicating through gamma rays.",
    "secondchar once again told the story about the explosion.",
    "As usual, we listened intently. It was still the biggest story in town, especially the past few days as everyone anticipated the opening of the bridge.",
    "About the time they arrived at the path to go up to the bridge secondchar startled a frog. Mainchar quickly and instinctively scooped the frog into his1 hands.",
    "The frog had a subtle yet distinct smell.",
    "The smell triggered his1 memory. Uh oh, uh oh, exclaims mainchar. Uh oh, what, said secondchar.",
    "mainchar said, I know what that strange smell was this morning in my bed. Do you remember the frog we caught yesterday?  The one into my napsack? They both responded, yes.",
    "mainchar said, well, the frog is still in the napsack and the napsack is next to my bed.",
    "They all agreed to go check on the frog.",
    "The entire walk back to mainchar's house, thirdchar was shooting wet mashed pea globs thru his3 straw at mainchar. Each glob of pea stuck to the back of mainchar's butt.",
    "Soon, they arrived to find the frog loudly croaking from within the napsack. They took the frog back to the river.",
    "mainchar's pet1 followed them to the river.",
    "When they set the frog free, the pet1 went to sniff where the frog jumped into the water, and that is when they saw a pea stuck in mainchar's pet1s butt.",
    "They headed up the path and arrived at the grand opening of the bridge.",
    "As they arrived, the mayor was handing a big set of scissors to secondchars uncle Ned.",
    "As Uncle Ned cut the ribbon, mainchar gamma rayed the other two and silently said, thirdchar, you are still the best pea shooter in town.",
    "thirdchar laughed and messaged back using gamma rays saying, mainchar, watch Uncle Neds butt.",
    "thirdchar snickered and loaded another mashed pea glob into his3 straw.",
    "The End",
    "Written by, Mark King"
   ]
}